import { Scenes, Markup } from "telegraf";
import { MyContext } from "../types/bot";
import { saveNomination } from "../utils/nomination/save-nomination";

const schools = [
  "Aldi BI",
  "BINOM - им. К.Сатпаева",
  "BINOM - им. А. Бөкейхана",
  "BINOM - им. Қадыр Мырза Әлі",
  "BINOM - им. А. Байтұрсынұлы",
  "BINOM - им. Ы. Алтынсарина",
  "BINOM - им. Ә. Кекілбаева",
  "BINOM - им. Д. Қонаева",
  "BINOM - им. Әл-Фараби",
  "УК BINOM",
  "FARABI Шымкент",
  "FARABI Атырау",
  "УК FARABI",
  "RIVIERA International school",
  "Quantum TECH",
  "Quantum STEM",
  "QMC",
  "BI Education",
];

const nominationScene = new Scenes.WizardScene<MyContext>(
  "nomination-wizard",

  // Шаг 0 — стартовое сообщение
  async (ctx) => {
    await ctx.reply(
      `«Құндылықтар елшісі» — күн сайын өз ісімен және қарым-қатынасында құндылықтарды көрсетіп, айналасына шабыт беретін ұстаздарды жыл сайын марапаттау бағдарламасы 💚

Жыл қорытындысы бойынша ТОП-5 ұстаз Компания есебінен жақын адамымен бірге саяхатқа барады ✈️

Сіз бір немесе бірнеше әріптесіңізді номинацияға ұсына аласыз.

-----------------------------------------

Программа «Амбассадор ценностей» — это ежегодное признание педагогов, которые каждый день вдохновляют своим примером и демонстрируют наши ценности в работе и в коммуникациях 💚 

ТОП-5 Амбассадоров отправятся в путешествие вместе с близким человеком за счёт Компании ✈️

Вы можете номинировать одного или нескольких коллег.`,
      Markup.inlineKeyboard([
        [
          Markup.button.callback(
            "ℹ️ Ознакомиться с критериями",
            "NOM_CRITERIA",
          ),
        ],
        [Markup.button.callback("🏅 Номинировать коллегу", "NOM_START")],
      ]),
    );
  },

  // Шаг 1 — ФИО автора
  async (ctx) => {
    if (!("text" in ((ctx.message as any) ?? {}))) return;
    (ctx.wizard.state as any).authorFullname = (ctx.message as any).text;
    await ctx.reply(
      "🏫 Выберите организацию, в которой работает вы работаете:",
      Markup.keyboard(schools.map((s) => [s]))
        .resize()
        .oneTime(),
    );
    return ctx.wizard.next();
  },

  // Шаг 1 — Школа автора
  async (ctx) => {
    if (!("text" in ((ctx.message as any) ?? {}))) return;
    (ctx.wizard.state as any).authorSchool = (ctx.message as any).text;
    await ctx.reply("✍️ Напишите ФИО коллеги:");
    return ctx.wizard.next();
  },
  // Шаг 2 — ФИО коллеги
  async (ctx) => {
    if (!("text" in ((ctx.message as any) ?? {}))) return;
    (ctx.wizard.state as any).colleagueFullName = (ctx.message as any).text;
    await ctx.reply(
      "🏫 Выберите организацию, в которой работает ваш коллега:",
      Markup.keyboard(schools.map((s) => [s]))
        .resize()
        .oneTime(),
    );
    return ctx.wizard.next();
  },

  // Шаг 2 — школа
  async (ctx) => {
    if (!("text" in ((ctx.message as any) ?? {}))) return;
    (ctx.wizard.state as any).colleagueSchool = (ctx.message as any).text;
    await ctx.reply("✍️ Укажите должность коллеги:");
    return ctx.wizard.next();
  },

  // Шаг 3 — должность
  async (ctx) => {
    if (!("text" in ((ctx.message as any) ?? {}))) return;
    (ctx.wizard.state as any).colleaguePosition = (ctx.message as any).text;

    const imagePath = require("path").resolve(
      __dirname,
      "../assets/nomination/image.png",
    );

    await ctx.replyWithPhoto(
      { source: imagePath },
      {
        caption: `Хорошо 💚  
Ознакомьтесь с ценностями Компании для дальнейшего описания «Почему номинант носитель наших ценностей?»`,
        reply_markup: {
          inline_keyboard: [
            [{ text: "✨ Начать описание", callback_data: "NOM_DESC" }],
          ],
        },
      },
    );

    return ctx.wizard.next();
  },

  // Шаг 4 — описание
  async (ctx) => {
    if (!("text" in ((ctx.message as any) ?? {}))) return;
    const text = (ctx.message as any).text;

    if (text.length < 30) {
      return ctx.reply(
        `Необходимо закончить описание. 
        Просим написать несколько предложений почему выдвенутый вами номинант соответствует званию "Амбассадор ценностей`,
      );
    }

    (ctx.wizard.state as any).description = text;

    await saveNomination(ctx.wizard.state);

    await ctx.reply(
      `Номинация успешно отправлена 💚

Спасибо, что укрепляете культуру признания в BI Education.`,
      Markup.removeKeyboard(),
    );

    return ctx.scene.leave();
  },
);

// === КНОПКИ ===

// начать заполнение
nominationScene.action("NOM_START", async (ctx) => {
  await ctx.answerCbQuery();
  await ctx.reply(
    `Для начала расскажите немного о себе 😊
✍️ Введите ваше ФИО:`,
    Markup.removeKeyboard(),
  );
  return ctx.wizard.selectStep(1);
});

// начать описание
nominationScene.action("NOM_DESC", async (ctx) => {
  await ctx.answerCbQuery();
  await ctx.reply(
    `✍️ Опишите, почему вы считаете этого человека достойным звания «Амбассадор ценностей». 💌

Пожалуйста, приведите конкретный пример поведения или историю из случаев в жизни. 

Пример: Асыл ұстаз честно говорит с коллегами, не скрывает информацию и принимает решения во благо школы, не причиняя вреда людям (порядочность и эмпатия). Организовал профессиональные сообщества по предметам, делится идеями и инструментами (непрерывное развитие), умеет объединять людей вокруг общих целей (лучшая команда и усердная работа).`,
  );
  return ctx.wizard.selectStep(4);
});

// критерии
nominationScene.action("NOM_CRITERIA", async (ctx) => {
  await ctx.answerCbQuery();
  await ctx.reply(
    `Номинация үміткері «Құндылықтар елшісі»

• Құндылықтарды өз іс-әрекетімен, қарым-қатынасымен және ұжымға қосқан үлесі арқылы көрсетеді
• Мектепте 1 жылдан астам жұмыс істейді
• Тәртіптік бұзушылық жағдайлары болмаған
• Алдағы жылы компаниядан кетуді жоспарламайды
• Қазір директор, директордың міндетін атқарушы немесе директордың орынбасары болып табылмайды

---------------------------------------------

Номинант "Амбассадор ценностей":

• Демонстрирует ценности через действия, отношения и вклад в сообщество
• Работает в школе больше 1 года
• У него нет дисциплинарных взысканий и случаев нарушения этического поведения
• Не планирует покинуть компанию в ближайщий год
• Не является директором, и.о. директора или заместителем директора

Если ваш коллега соответствует этим критериям — вы можете перейти к номинации 💚`,
    Markup.inlineKeyboard([
      [Markup.button.callback("🏅 Номинировать коллегу", "NOM_START")],
      [Markup.button.callback("❌ Отмена", "NOM_CANCEL")],
    ]),
  );
});

// отмена
nominationScene.action("NOM_CANCEL", async (ctx) => {
  await ctx.answerCbQuery();
  await ctx.reply("❌ Действие отменено.", Markup.removeKeyboard());
  return ctx.scene.leave();
});

export default nominationScene;
